[
  "If you had asked me back in grade school what I wanted to be when I grew up, I would have said my first choice was an actor, but if I couldn't be that, I'd want to be a superhero.",
  "You live these three months in this reality, in this dark reality. You don't want to do those films every year because they're taxing. I started smoking a lot of cigarettes.",
  "I haven't had that many weird encounters with fans, thank God.",
  "If you take my performance or my understanding of the role and my appreciation for story and then dress it in CGI, that I guess becomes an action film.",
  "If you're the type of person who has to fulfill your dreams, you've gotta be resourceful to make sure you can do it. I came out to California when I was 21, thinking my New York credentials would take me all the way. I came back home a year later all dejected and a failure.",
  "We all deal with being unfairly judged.",
  "I shaved my head about 15 years ago and the first time I shaved it, I started running my hand through my hair and it was very therapeutic.",
  "You break her heart, I'll break your neck.",
  "I'm not really afraid of the dark, except if I'm walking. The thing that scares me the most is the possibility of walking into a wall and busting my lip.",
  "It's hard for me to talk about Dom right now because I am Dom right now. So it's a really strange exercise to try to reflect on something that I am at the moment. But I guarantee you that when I'm done with the movie and you ask me that question, I'll be able to give you something insightful.",
  "I am groot",
  "What was bizarre, when I was younger, I never watched TV. I would rather watch a movie 100 times than to watch a TV show, just to find another nuance. I can't tell you how many times I've watched 'On the Waterfront', just to find a flaw so that I can learn and try to improve my thing.",
  "I was raised in New York City and raised in the New York City theater world. My father was a theater director and an acting teacher, and it was not uncommon for me to have long discussions about the method and what the various different processes were to finding a character and exploring character and realizing that character.",
  "I am definitely a person of color.",
  "I love women more than anything.",
  "A person in my position has to restrain himself.",
  "One day I will eliminate all Egyptians from this earth. It's what God would have wanted.",
  "It's really bizarre because no one knows this, but elephants have killed more animal trainers than any other animal.",
  "My mom insisted on multigrain bread and never allowed soda in the house.",
  "I do practice martial arts, more as a recreational thing, but a lot of my friends have been heavyweight champions the in mixed martial arts world.",
  "When I got on the set of 'Saving Private Ryan,' I discovered, to my amazement, that Steven Spielberg is a gamer.",
  "My mom used to say that I became a fighter and a scrapper and a tough guy to protect who I am at my core.",
  "I've been auditioning since I was 7 years old.",
  "I always have issues with trust.",
  "I was a bouncer for ten years in New York City.",
  "I have dangerous bones in my body.",
  "I love what I do.",
  "Well, love motivates me in everything I do.",
  "Most of my confidence came from being with ladies, because I certainly wasn't getting any acting jobs.",
  "I've directed independent film.",
  "If it's an amazing role, I'll do anything.",
  "I've turned down twentysomething million dollars for movies.",
  "When you go to the movies with your whole family, it's a different experience. For some reason, it's something that you're all doing together and you take away something special in that.",
  "It's like you have a child and you think, 'Everything that I've done up until this point is insignificant in comparison to being a father.' It's a beautiful, beautiful thing.",
  "It wasn't until I went to college and I got my first motorcycle that I understood the thrill of speed.",
  "I was the oldest of the children in my family. I had to do a lot of diaper-changing and lunch-making. I was taking my little sister to ballet, picking up my brother, sort of being a super-nanny.",
  "The films that I do are deep, introspective, brooding roles that you're in this heavy headspace all the time.",
  "With age, you get to a place where you don't want to knock people out. You just want to give people a hug.",
  "It's insecurity that is always chasing you and standing in the way of your dreams.",
  "The one thing I will never do is become pigeonholed.",
  "I am truly multi-racial. I never knew my biological father. I've always had less information than I would have liked to have had. All I know from my mother is that I have connections to many different cultures.",
  "The man who raised me is black. Culturally, he made me who I am. He was a theatre director, so he also guided me artistically.",
  "I've worked out for years. For a long time, it was my only sense of gratification.",
  "The thing I'm scared of most is not fulfilling my work. There's so much anxiety around trying to get a movie made that you don't really get to be afraid of anything else."

]